Samples/square_(-3,-3)_(3,-3)_(-3,3)_(3,3)_cushion/halfcircle/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
	type		zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           $internalField;
    }
    
    cylinder
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
    
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
